name: "GraspNet"
layer {
	name: "Color_data"
	type: "Input"
	top: "Color_data"
	input_param { shape: { dim: 1 dim: 1 dim: 100 dim: 100 } }
}
layer{
	name:"Color_conv1"
	type:"Convolution"
	bottom:"Color_data"
	top:"Color_conv1"
	param{
		lr_mult:1
	}
	param{
		lr_mult:2
	}
	convolution_param{
		num_output:20
		kernel_size:5
		stride:2
	}
}

layer {
  name: "Color_relu1"
  type: "ReLU"
  bottom: "Color_conv1"
  top: "Color_conv1"
}

layer {
  name: "Color_pool1"
  type: "Pooling"
  bottom: "Color_conv1"
  top: "Color_pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer{
	name:"Color_conv2"
	type:"Convolution"
	bottom:"Color_pool1"
	top:"Color_conv2"
	param{
		lr_mult:1
	}
	param{
		lr_mult:2
	}
	convolution_param{
		num_output:20
		kernel_size:5
		stride:1
	}
}
layer {
  name: "Color_relu2"
  type: "ReLU"
  bottom: "Color_conv2"
  top: "Color_conv2"
}
layer {
  name: "Color_pool2"
  type: "Pooling"
  bottom: "Color_conv2"
  top: "Color_pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer{
	name:"Color_conv3"
	type:"Convolution"
	bottom:"Color_pool2"
	top:"Color_conv3"
	param{
		lr_mult:1
	}
	param{
		lr_mult:2
	}
	convolution_param{
		num_output:40
		kernel_size:5
		stride:1
	}
}
layer {
  name: "Color_relu3"
  type: "ReLU"
  bottom: "Color_conv3"
  top: "Color_conv3"
}

layer {
  name: "Color_fc4"
  type: "InnerProduct"
  bottom: "Color_conv3"
  top: "Color_fc4"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 50
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "Color_relu4"
  type: "ReLU"
  bottom: "Color_fc4"
  top: "Color_fc4"
}

layer{
	name:"DexNet-CloudPoints"
	type:"Input"
	top:"data"
	input_param { shape: { dim: 1 dim: 1 dim: 50 dim: 50 } }
	
}
layer{
	name:"DexNet-conv1"
	type:"Convolution"
	bottom:"data"
	top:"conv1"
	param{
		lr_mult:1
	}
	param{
		lr_mult:2
	}
	convolution_param{
		num_output:20
		kernel_size:5
		stride:1
	}
}

layer {
  name: "DexNet-relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}

layer {
  name: "DexNet-pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer{
	name:"DexNet-conv2"
	type:"Convolution"
	bottom:"pool1"
	top:"conv2"
	param{
		lr_mult:1
	}
	param{
		lr_mult:2
	}
	convolution_param{
		num_output:20
		kernel_size:5
		stride:1
	}
}

layer {
  name: "DexNet-relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "DexNet-pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer{
	name:"DexNet-conv3"
	type:"Convolution"
	bottom:"pool2"
	top:"conv3"
	param{
		lr_mult:1
	}
	param{
		lr_mult:2
	}
	convolution_param{
		num_output:40
		kernel_size:5
		stride:1
	}
}
layer {
  name: "DexNet-relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}

layer {
  name: "DexNet-fc4"
  type: "InnerProduct"
  bottom: "conv3"
  top: "fc4"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 50
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "DexNet-relu4"
  type: "ReLU"
  bottom: "fc4"
  top: "fc4"
}

layer{
	name:"Grasp_Concat"
	type:"Concat"
	bottom:"fc4"
	bottom:"Color_fc4"
	top:"Concat"
	concat_param{
		axis:1
	}
}

layer {
  name: "Grasp_fc5"
  type: "InnerProduct"
  bottom: "Concat"
  top: "Grasp_fc5"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 100
  }
}
layer {
  name: "Grasp_relu5"
  type: "ReLU"
  bottom: "Grasp_fc5"
  top: "Grasp_fc5"
}
layer {
  name: "Grasp_fc6"
  type: "InnerProduct"
  bottom: "Grasp_fc5"
  top: "Grasp_fc6"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 2
  }
}

layer {
  name: "prob"
  type: "Softmax"
  bottom: "Grasp_fc6"
  top: "prob"
}

